modm-ext/archive-stmicro-svd/header_stm32h7a3agi6q.svd
      <register>
        <name>HUFFENC_AC0.9</name>
        <addressOffset>0x524</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.10</name>
        <addressOffset>0x528</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.11</name>
        <addressOffset>0x52c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.12</name>
        <addressOffset>0x530</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.13</name>
        <addressOffset>0x534</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.14</name>
        <addressOffset>0x538</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.15</name>
        <addressOffset>0x53c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.16</name>
        <addressOffset>0x540</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.17</name>
        <addressOffset>0x544</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.18</name>
        <addressOffset>0x548</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.19</name>
        <addressOffset>0x54c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.20</name>
        <addressOffset>0x550</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.21</name>
        <addressOffset>0x554</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.22</name>
        <addressOffset>0x558</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.23</name>
        <addressOffset>0x55c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.24</name>
        <addressOffset>0x560</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.25</name>
        <addressOffset>0x564</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.26</name>
        <addressOffset>0x568</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.27</name>
        <addressOffset>0x56c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.28</name>
        <addressOffset>0x570</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.29</name>
        <addressOffset>0x574</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.30</name>
        <addressOffset>0x578</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.31</name>
        <addressOffset>0x57c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.32</name>
        <addressOffset>0x580</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.33</name>
        <addressOffset>0x584</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.34</name>
        <addressOffset>0x588</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.35</name>
        <addressOffset>0x58c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.36</name>
        <addressOffset>0x590</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.37</name>
        <addressOffset>0x594</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.38</name>
        <addressOffset>0x598</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.39</name>
        <addressOffset>0x59c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.40</name>
        <addressOffset>0x5a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.41</name>
        <addressOffset>0x5a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.42</name>
        <addressOffset>0x5a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.43</name>
        <addressOffset>0x5ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.44</name>
        <addressOffset>0x5b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.45</name>
        <addressOffset>0x5b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.46</name>
        <addressOffset>0x5b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.47</name>
        <addressOffset>0x5bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.48</name>
        <addressOffset>0x5c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.49</name>
        <addressOffset>0x5c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.50</name>
        <addressOffset>0x5c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.51</name>
        <addressOffset>0x5cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.52</name>
        <addressOffset>0x5d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.53</name>
        <addressOffset>0x5d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.54</name>
        <addressOffset>0x5d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.55</name>
        <addressOffset>0x5dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.56</name>
        <addressOffset>0x5e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.57</name>
        <addressOffset>0x5e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.58</name>
        <addressOffset>0x5e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.59</name>
        <addressOffset>0x5ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.60</name>
        <addressOffset>0x5f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.61</name>
        <addressOffset>0x5f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.62</name>
        <addressOffset>0x5f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.63</name>
        <addressOffset>0x5fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.64</name>
        <addressOffset>0x600</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.65</name>
        <addressOffset>0x604</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.66</name>
        <addressOffset>0x608</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.67</name>
        <addressOffset>0x60c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.68</name>
        <addressOffset>0x610</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.69</name>
        <addressOffset>0x614</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.70</name>
        <addressOffset>0x618</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.71</name>
        <addressOffset>0x61c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.72</name>
        <addressOffset>0x620</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.73</name>
        <addressOffset>0x624</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.74</name>
        <addressOffset>0x628</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.75</name>
        <addressOffset>0x62c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.76</name>
        <addressOffset>0x630</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.77</name>
        <addressOffset>0x634</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.78</name>
        <addressOffset>0x638</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.79</name>
        <addressOffset>0x63c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.80</name>
        <addressOffset>0x640</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.81</name>
        <addressOffset>0x644</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.82</name>
        <addressOffset>0x648</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.83</name>
        <addressOffset>0x64c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.84</name>
        <addressOffset>0x650</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.85</name>
        <addressOffset>0x654</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.86</name>
        <addressOffset>0x658</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.87</name>
        <addressOffset>0x65c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.0</name>
        <addressOffset>0x660</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.1</name>
        <addressOffset>0x664</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.2</name>
        <addressOffset>0x668</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.3</name>
        <addressOffset>0x66c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.4</name>
        <addressOffset>0x670</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.5</name>
        <addressOffset>0x674</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.6</name>
        <addressOffset>0x678</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.7</name>
        <addressOffset>0x67c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.8</name>
        <addressOffset>0x680</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.9</name>
        <addressOffset>0x684</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.10</name>
        <addressOffset>0x688</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.11</name>
        <addressOffset>0x68c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.12</name>
        <addressOffset>0x690</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.13</name>
        <addressOffset>0x694</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.14</name>
        <addressOffset>0x698</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.15</name>
        <addressOffset>0x69c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.16</name>
        <addressOffset>0x6a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.17</name>
        <addressOffset>0x6a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.18</name>
        <addressOffset>0x6a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.19</name>
        <addressOffset>0x6ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.20</name>
        <addressOffset>0x6b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.21</name>
        <addressOffset>0x6b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.22</name>
        <addressOffset>0x6b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.23</name>
        <addressOffset>0x6bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.24</name>
        <addressOffset>0x6c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.25</name>
        <addressOffset>0x6c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.26</name>
        <addressOffset>0x6c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.27</name>
        <addressOffset>0x6cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.28</name>
        <addressOffset>0x6d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.29</name>
        <addressOffset>0x6d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.30</name>
        <addressOffset>0x6d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.31</name>
        <addressOffset>0x6dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.32</name>
        <addressOffset>0x6e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.33</name>
        <addressOffset>0x6e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.34</name>
        <addressOffset>0x6e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.35</name>
        <addressOffset>0x6ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.36</name>
        <addressOffset>0x6f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.37</name>
        <addressOffset>0x6f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.38</name>
        <addressOffset>0x6f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.39</name>
        <addressOffset>0x6fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.40</name>
        <addressOffset>0x700</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.41</name>
        <addressOffset>0x704</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.42</name>
        <addressOffset>0x708</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.43</name>
        <addressOffset>0x70c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.44</name>
        <addressOffset>0x710</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.45</name>
        <addressOffset>0x714</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.46</name>
        <addressOffset>0x718</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.47</name>
        <addressOffset>0x71c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.48</name>
        <addressOffset>0x720</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.49</name>
        <addressOffset>0x724</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.50</name>
        <addressOffset>0x728</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.51</name>
        <addressOffset>0x72c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.52</name>
        <addressOffset>0x730</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.53</name>
        <addressOffset>0x734</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.54</name>
        <addressOffset>0x738</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.55</name>
        <addressOffset>0x73c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.56</name>
        <addressOffset>0x740</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.57</name>
        <addressOffset>0x744</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.58</name>
        <addressOffset>0x748</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.59</name>
        <addressOffset>0x74c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.60</name>
        <addressOffset>0x750</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.61</name>
        <addressOffset>0x754</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.62</name>
        <addressOffset>0x758</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.63</name>
        <addressOffset>0x75c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.64</name>
        <addressOffset>0x760</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.65</name>
        <addressOffset>0x764</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.66</name>
        <addressOffset>0x768</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.67</name>
        <addressOffset>0x76c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.68</name>
        <addressOffset>0x770</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.69</name>
        <addressOffset>0x774</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.70</name>
        <addressOffset>0x778</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.71</name>
        <addressOffset>0x77c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.72</name>
        <addressOffset>0x780</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.73</name>
        <addressOffset>0x784</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.74</name>
        <addressOffset>0x788</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.75</name>
        <addressOffset>0x78c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.76</name>
        <addressOffset>0x790</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.77</name>
        <addressOffset>0x794</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.78</name>
        <addressOffset>0x798</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.79</name>
        <addressOffset>0x79c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.80</name>
        <addressOffset>0x7a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.81</name>
        <addressOffset>0x7a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.82</name>
        <addressOffset>0x7a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.83</name>
        <addressOffset>0x7ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.84</name>
        <addressOffset>0x7b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.85</name>
        <addressOffset>0x7b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.86</name>
        <addressOffset>0x7b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC1.87</name>
        <addressOffset>0x7bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC0.0</name>
        <addressOffset>0x7c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_DC0.1</name>
        <addressOffset>0x7c4</addressOffset>
        <size>0x20</size>
      </register>
