modm-ext/archive-stmicro-svd/header_stm32h7a3agi6q.svd
      <register>
        <name>LUT.811</name>
        <addressOffset>0x1cac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.812</name>
        <addressOffset>0x1cb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.813</name>
        <addressOffset>0x1cb4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.814</name>
        <addressOffset>0x1cb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.815</name>
        <addressOffset>0x1cbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.816</name>
        <addressOffset>0x1cc0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.817</name>
        <addressOffset>0x1cc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.818</name>
        <addressOffset>0x1cc8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.819</name>
        <addressOffset>0x1ccc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.820</name>
        <addressOffset>0x1cd0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.821</name>
        <addressOffset>0x1cd4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.822</name>
        <addressOffset>0x1cd8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.823</name>
        <addressOffset>0x1cdc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.824</name>
        <addressOffset>0x1ce0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.825</name>
        <addressOffset>0x1ce4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.826</name>
        <addressOffset>0x1ce8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.827</name>
        <addressOffset>0x1cec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.828</name>
        <addressOffset>0x1cf0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.829</name>
        <addressOffset>0x1cf4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.830</name>
        <addressOffset>0x1cf8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.831</name>
        <addressOffset>0x1cfc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.832</name>
        <addressOffset>0x1d00</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.833</name>
        <addressOffset>0x1d04</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.834</name>
        <addressOffset>0x1d08</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.835</name>
        <addressOffset>0x1d0c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.836</name>
        <addressOffset>0x1d10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.837</name>
        <addressOffset>0x1d14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.838</name>
        <addressOffset>0x1d18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.839</name>
        <addressOffset>0x1d1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.840</name>
        <addressOffset>0x1d20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.841</name>
        <addressOffset>0x1d24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.842</name>
        <addressOffset>0x1d28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.843</name>
        <addressOffset>0x1d2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.844</name>
        <addressOffset>0x1d30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.845</name>
        <addressOffset>0x1d34</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.846</name>
        <addressOffset>0x1d38</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.847</name>
        <addressOffset>0x1d3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.848</name>
        <addressOffset>0x1d40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.849</name>
        <addressOffset>0x1d44</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.850</name>
        <addressOffset>0x1d48</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.851</name>
        <addressOffset>0x1d4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.852</name>
        <addressOffset>0x1d50</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.853</name>
        <addressOffset>0x1d54</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.854</name>
        <addressOffset>0x1d58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.855</name>
        <addressOffset>0x1d5c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.856</name>
        <addressOffset>0x1d60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.857</name>
        <addressOffset>0x1d64</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.858</name>
        <addressOffset>0x1d68</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.859</name>
        <addressOffset>0x1d6c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.860</name>
        <addressOffset>0x1d70</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.861</name>
        <addressOffset>0x1d74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.862</name>
        <addressOffset>0x1d78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.863</name>
        <addressOffset>0x1d7c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.864</name>
        <addressOffset>0x1d80</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.865</name>
        <addressOffset>0x1d84</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.866</name>
        <addressOffset>0x1d88</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.867</name>
        <addressOffset>0x1d8c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.868</name>
        <addressOffset>0x1d90</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.869</name>
        <addressOffset>0x1d94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.870</name>
        <addressOffset>0x1d98</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.871</name>
        <addressOffset>0x1d9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.872</name>
        <addressOffset>0x1da0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.873</name>
        <addressOffset>0x1da4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.874</name>
        <addressOffset>0x1da8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.875</name>
        <addressOffset>0x1dac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.876</name>
        <addressOffset>0x1db0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.877</name>
        <addressOffset>0x1db4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.878</name>
        <addressOffset>0x1db8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.879</name>
        <addressOffset>0x1dbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.880</name>
        <addressOffset>0x1dc0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.881</name>
        <addressOffset>0x1dc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.882</name>
        <addressOffset>0x1dc8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.883</name>
        <addressOffset>0x1dcc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.884</name>
        <addressOffset>0x1dd0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.885</name>
        <addressOffset>0x1dd4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.886</name>
        <addressOffset>0x1dd8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.887</name>
        <addressOffset>0x1ddc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.888</name>
        <addressOffset>0x1de0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.889</name>
        <addressOffset>0x1de4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.890</name>
        <addressOffset>0x1de8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.891</name>
        <addressOffset>0x1dec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.892</name>
        <addressOffset>0x1df0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.893</name>
        <addressOffset>0x1df4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.894</name>
        <addressOffset>0x1df8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.895</name>
        <addressOffset>0x1dfc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.896</name>
        <addressOffset>0x1e00</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.897</name>
        <addressOffset>0x1e04</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.898</name>
        <addressOffset>0x1e08</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.899</name>
        <addressOffset>0x1e0c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.900</name>
        <addressOffset>0x1e10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.901</name>
        <addressOffset>0x1e14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.902</name>
        <addressOffset>0x1e18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.903</name>
        <addressOffset>0x1e1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.904</name>
        <addressOffset>0x1e20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.905</name>
        <addressOffset>0x1e24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.906</name>
        <addressOffset>0x1e28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.907</name>
        <addressOffset>0x1e2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.908</name>
        <addressOffset>0x1e30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.909</name>
        <addressOffset>0x1e34</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.910</name>
        <addressOffset>0x1e38</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.911</name>
        <addressOffset>0x1e3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.912</name>
        <addressOffset>0x1e40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.913</name>
        <addressOffset>0x1e44</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.914</name>
        <addressOffset>0x1e48</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.915</name>
        <addressOffset>0x1e4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.916</name>
        <addressOffset>0x1e50</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.917</name>
        <addressOffset>0x1e54</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.918</name>
        <addressOffset>0x1e58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.919</name>
        <addressOffset>0x1e5c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.920</name>
        <addressOffset>0x1e60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.921</name>
        <addressOffset>0x1e64</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.922</name>
        <addressOffset>0x1e68</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.923</name>
        <addressOffset>0x1e6c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.924</name>
        <addressOffset>0x1e70</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.925</name>
        <addressOffset>0x1e74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.926</name>
        <addressOffset>0x1e78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.927</name>
        <addressOffset>0x1e7c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.928</name>
        <addressOffset>0x1e80</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.929</name>
        <addressOffset>0x1e84</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.930</name>
        <addressOffset>0x1e88</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.931</name>
        <addressOffset>0x1e8c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.932</name>
        <addressOffset>0x1e90</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.933</name>
        <addressOffset>0x1e94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.934</name>
        <addressOffset>0x1e98</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.935</name>
        <addressOffset>0x1e9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.936</name>
        <addressOffset>0x1ea0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.937</name>
        <addressOffset>0x1ea4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.938</name>
        <addressOffset>0x1ea8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.939</name>
        <addressOffset>0x1eac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.940</name>
        <addressOffset>0x1eb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.941</name>
        <addressOffset>0x1eb4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.942</name>
        <addressOffset>0x1eb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.943</name>
        <addressOffset>0x1ebc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.944</name>
        <addressOffset>0x1ec0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.945</name>
        <addressOffset>0x1ec4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.946</name>
        <addressOffset>0x1ec8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.947</name>
        <addressOffset>0x1ecc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.948</name>
        <addressOffset>0x1ed0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.949</name>
        <addressOffset>0x1ed4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.950</name>
        <addressOffset>0x1ed8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.951</name>
        <addressOffset>0x1edc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.952</name>
        <addressOffset>0x1ee0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.953</name>
        <addressOffset>0x1ee4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.954</name>
        <addressOffset>0x1ee8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.955</name>
        <addressOffset>0x1eec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.956</name>
        <addressOffset>0x1ef0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.957</name>
        <addressOffset>0x1ef4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.958</name>
        <addressOffset>0x1ef8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.959</name>
        <addressOffset>0x1efc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.960</name>
        <addressOffset>0x1f00</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.961</name>
        <addressOffset>0x1f04</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.962</name>
        <addressOffset>0x1f08</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.963</name>
        <addressOffset>0x1f0c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.964</name>
        <addressOffset>0x1f10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.965</name>
        <addressOffset>0x1f14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.966</name>
        <addressOffset>0x1f18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.967</name>
        <addressOffset>0x1f1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.968</name>
        <addressOffset>0x1f20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.969</name>
        <addressOffset>0x1f24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.970</name>
        <addressOffset>0x1f28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.971</name>
        <addressOffset>0x1f2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.972</name>
        <addressOffset>0x1f30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.973</name>
        <addressOffset>0x1f34</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.974</name>
        <addressOffset>0x1f38</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.975</name>
        <addressOffset>0x1f3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.976</name>
        <addressOffset>0x1f40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.977</name>
        <addressOffset>0x1f44</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.978</name>
        <addressOffset>0x1f48</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.979</name>
        <addressOffset>0x1f4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.980</name>
        <addressOffset>0x1f50</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.981</name>
        <addressOffset>0x1f54</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.982</name>
        <addressOffset>0x1f58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.983</name>
        <addressOffset>0x1f5c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.984</name>
        <addressOffset>0x1f60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.985</name>
        <addressOffset>0x1f64</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.986</name>
        <addressOffset>0x1f68</addressOffset>
        <size>0x20</size>
      </register>
